<a href="https://colab.research.google.com/github/lianatasha/lia/blob/master/PandasAgo22.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

Pandas es un paquete de Python que provee dos estructuras de datos para el análisis de datos "relacionales" de manera rápida, flexible y expresiva. Pandas está construido sobre Numpy, por lo que muchas de las ventajas de utilizar Numpy se trasladan a Pandas.

Pandas puede ser utilizado para trabajar con diferentes tipos de datos:

* Tabulares, con datos en columnas que comparten un mismo tipo (por ejemplo, tablas de una base de datos y hojas de Excel).
* Series de tiempo.
* Matrices con columnas y filas etiquetadas.
* Datos de experimentos estadísticos en general.

In [1]:
#pd es el alias comun de pandas
import pandas as pd
import numpy as np

# Estructuras

## Series

La primera estructura de datos de Pandas son las Series. Una Serie es utilizada para arreglos 1D etiquetados con un mismo tipo de dato en todos sus elementos. Una serie es un arreglo 1D donde cada elemento tiene asignado un índice:


| index   || |
|---||----|
| a || s1 |
| b || s2 |
| c || s3 |
| ... || ... |

In [2]:
#un objeto series desde una lista
s1 = pd.Series(data=[1, 1, 2, 3, 5], index=["a", "b", "c", "d", "e"])
s1

a    1
b    1
c    2
d    3
e    5
dtype: int64

## Dataframe

Los Dataframes son la segunda estructura en Pandas, éstos son utilizados para datos 2D etiquetados (columnas con nombres generalmente). Las columnas de un Dataframe pueden tener tipos de dato diferentes. Puedes pensar en un Dataframe  como un contenedor de Series, donde cada columna es una Serie (arreglo 1D con etiquetas). Un Dataframe puede representarse como una tabla donde cada fila tiene asignado un índice y cada columna un nombre:

| index\columns  || A  | B  | C  | D  |
|---||----|----|----|----|
| 1 || a1 | b1 | c1 | d1 |
| 2 || a2 | b2 | c2 | d2 |
| 3 || a3 | b3 | c3 | d3 |

In [3]:
#un dataframe aleatorio con numpy random
df = pd.DataFrame(np.random.randn(6, 4), columns=["A", "B", "C", "D"])
df

          A         B         C         D
0 -0.407549  0.746503 -0.486613  0.490029
1 -1.045711 -0.335270  0.071375  2.071805
2  0.258904 -0.582571 -0.385520  0.449454
3  1.549497  1.052465  1.246970  0.982632
4 -0.019649 -0.597528  0.128990 -0.163149
5 -0.765895 -1.201212  1.074760  0.569080

# Creación y almacenamiento

## Creación desde diccionarios de listas

In [4]:
#Un diccionario de python
dict1 = {'pais': ['Mexico',
'EUA', "Francia"], 'continente': ["America", "America", "Europa"], 'poblacion': [129, 325, 67]}

paises = pd.DataFrame(dict1)
paises

      pais continente  poblacion
0   Mexico    America        129
1      EUA    America        325
2  Francia     Europa         67

## Creación desde diccionario anidado

In [5]:
#Un diccionario anidado de python
#las claves anidadas especifican el indice de las filas
dict2 = {'pais': {"p1": 'Mexico',
"p2": 'EUA', "p3": "Francia"}, 'continente': {"p1": "America", "p2": "America", "p3": "Europa"}, 'poblacion': {"p1": 129, "p2": 325, "p3": 67}}

paises = pd.DataFrame(dict2)
paises

       pais continente  poblacion
p1   Mexico    America        129
p2      EUA    America        325
p3  Francia     Europa         67

## Creación desde archivos csv

In [7]:
!ls sample_data/

anscombe.json		      mnist_test.csv
california_housing_test.csv   mnist_train_small.csv
california_housing_train.csv  README.md

In [6]:
#leamos un archivo csv almacenado por colab
cali_housing = pd.read_csv("sample_data/california_housing_test.csv", nrows=10,)
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0
5,-119.56,36.51,37.0,1018.0,213.0,663.0,204.0,1.6635,67000.0
6,-121.43,38.63,43.0,1009.0,225.0,604.0,218.0,1.6641,67000.0
7,-120.65,35.48,19.0,2310.0,471.0,1341.0,441.0,3.2250,166900.0
8,-122.84,38.40,15.0,3080.0,617.0,1446.0,599.0,3.6696,194400.0
9,-118.02,34.08,31.0,2402.0,632.0,2830.0,603.0,2.3333,164200.0

## Creación desde archivos excel

In [9]:
pip install xlrd==1.2.0

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting xlrd==1.2.0
  Downloading xlrd-1.2.0-py2.py3-none-any.whl (103 kB)
     |████████████████████████████████| 103 kB 34.8 MB/s
Installing collected packages: xlrd
  Attempting uninstall: xlrd
    Found existing installation: xlrd 1.1.0
    Uninstalling xlrd-1.1.0:
      Successfully uninstalled xlrd-1.1.0
Successfully installed xlrd-1.2.0

In [10]:
#cargar el archivo en formato xls a un pandas dataframe
#cali_housing = pd.read_excel("california_housing_test.xlsx", index_col=0, header_col=0)
cali_housing = pd.read_excel("/content/california_housing_test2.xlsx")
cali_housing

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27,3885,661,1537,606,6.6085,344700
1,-118.30,34.26,43,1510,310,809,277,3.5990,176500
2,-117.81,33.78,27,3589,507,1484,495,5.7934,270500
3,-118.36,33.82,28,67,15,49,11,6.1359,330000
4,-119.67,36.33,19,1241,244,850,237,2.9375,81700
...,...,...,...,...,...,...,...,...,...
2995,-119.86,34.42,23,1450,642,1258,607,1.1790,225000
2996,-118.14,34.06,27,5257,1082,3496,1036,3.3906,237200
2997,-119.70,36.30,10,956,201,693,220,2.2895,62000
2998,-117.12,34.10,40,96,14,46,14,3.2708,162500
2999,-119.63,34.42,42,1765,263,753,260,8.5608,500001

In [9]:
# Cargar un archivo de excel a colab desde github
!curl --remote-name \
     -H 'Accept: application/vnd.github.v3.raw' \
     --location https://github.com/jhermosillo/diplomado_CDD2019/raw/master/Programaci%C3%B3n%20en%20Python/data/california_housing_test.xlsx

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
100  194k    0  194k    0     0  1981k      0 --:--:-- --:--:-- --:--:-- 1961k

## Persistencia a disco

In [ ]:
cali_housing.to_csv("cali_housing.csv")
#o en formato de excel:
cali_housing.to_excel("cali_housing.xlsx")

Ahora se crearon dos archivos en colab

In [ ]:
!ls

california_housing_test.xlsx  cali_housing.csv	cali_housing.xlsx  sample_data

# Accediendo a los datos

## info()

El método info() puede usarse para , mostrar la información general del objeto de Pandas, como el índice y los tipos de datos usados.

In [ ]:
cali_housing.info()

## head() y tail()

Los métodos head() y tail() devuelven una pequeña muestra de los primeros o últimos elementos de un objeto Series o Dataframe. Ambas pueden recibir como parámetro el número de elementos que se desean visualizar, por defecto es igual a 5.

In [ ]:
cali_housing.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
0,-122.05,37.37,27.0,3885.0,661.0,1537.0,606.0,6.6085,344700.0
1,-118.30,34.26,43.0,1510.0,310.0,809.0,277.0,3.5990,176500.0
2,-117.81,33.78,27.0,3589.0,507.0,1484.0,495.0,5.7934,270500.0
3,-118.36,33.82,28.0,67.0,15.0,49.0,11.0,6.1359,330000.0
4,-119.67,36.33,19.0,1241.0,244.0,850.0,237.0,2.9375,81700.0

In [ ]:
cali_housing.tail(3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
7,-120.65,35.48,19.0,2310.0,471.0,1341.0,441.0,3.2250,166900.0
8,-122.84,38.40,15.0,3080.0,617.0,1446.0,599.0,3.6696,194400.0
9,-118.02,34.08,31.0,2402.0,632.0,2830.0,603.0,2.3333,164200.0

## df.sample()

Para obtener una muestra aleatoria del objeto.

In [ ]:
cali_housing.sample(n=3)

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
5,-119.56,36.51,37.0,1018.0,213.0,663.0,204.0,1.6635,67000.0
8,-122.84,38.40,15.0,3080.0,617.0,1446.0,599.0,3.6696,194400.0
9,-118.02,34.08,31.0,2402.0,632.0,2830.0,603.0,2.3333,164200.0

## df.index

El atributo index regresa el índice del objeto de Pandas.

In [ ]:
cali_housing.index

RangeIndex(start=0, stop=10, step=1)

## df.columns

El atributo columns de un DataFrame devuelve las columnas del mismo.

In [ ]:
cali_housing.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

## describe()

El método describe() regresa un resúmen estadístico del objeto.

In [ ]:
cali_housing.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,-119.869000,35.866000,28.900000,2011.100000,389.500000,1161.300000,369.100000,3.762980,186290.000000
std,1.800077,1.868108,9.803061,1247.223267,218.753159,757.210678,207.889634,1.817015,101796.337524
min,-122.840000,33.780000,15.000000,67.000000,15.000000,49.000000,11.000000,1.663500,67000.000000
25%,-121.235000,34.125000,21.000000,1073.750000,229.750000,699.500000,222.750000,2.484350,102325.000000
50%,-119.615000,35.905000,27.500000,1910.000000,390.500000,1095.500000,359.000000,3.412000,171700.000000
75%,-118.315000,37.155000,35.500000,2910.500000,589.500000,1474.500000,573.000000,5.262450,251475.000000
max,-117.810000,38.630000,43.000000,3885.000000,661.000000,2830.000000,606.000000,6.608500,344700.000000

# Selección - asignación

## Seleccionando columnas

Puedes usar dos notaciones para seleccionar una columna de un DataFrame, cualquiera de éstas devolverá un objeto Series.



```
df.["A"]
```

o



```
df.A
```

In [ ]:
#seleccionar la columna devuelve un objeto Series
cali_housing["latitude"]

0       37.37
1       34.26
2       33.78
3       33.82
4       36.33
        ...
2995    34.42
2996    34.06
2997    36.30
2998    34.10
2999    34.42
Name: latitude, Length: 3000, dtype: float64

In [ ]:
#usa segunda opcion para seleccionar columnas
cali_housing.latitude

0       37.37
1       34.26
2       33.78
3       33.82
4       36.33
        ...
2995    34.42
2996    34.06
2997    36.30
2998    34.10
2999    34.42
Name: latitude, Length: 3000, dtype: float64

In [ ]:
#seleccionando una columna como un dataframe
cali_housing[["latitude"]]

      latitude
0        37.37
1        34.26
2        33.78
3        33.82
4        36.33
...        ...
2995     34.42
2996     34.06
2997     36.30
2998     34.10
2999     34.42

[3000 rows x 1 columns]

Seleccionando múltiples columnas



```
df[["A", ...]]
```

In [ ]:
cali_housing[["longitude", "latitude"]]

      longitude  latitude
0       -122.05     37.37
1       -118.30     34.26
2       -117.81     33.78
3       -118.36     33.82
4       -119.67     36.33
...         ...       ...
2995    -119.86     34.42
2996    -118.14     34.06
2997    -119.70     36.30
2998    -117.12     34.10
2999    -119.63     34.42

[3000 rows x 2 columns]

## Seleccionando filas con slicing

In [ ]:
cali_housing[0:3]

   longitude  latitude  ...  median_income  median_house_value
0    -122.05     37.37  ...         6.6085              344700
1    -118.30     34.26  ...         3.5990              176500
2    -117.81     33.78  ...         5.7934              270500

[3 rows x 9 columns]

## Selección con etiquetas loc

In [ ]:
cali_housing.loc[:, "total_rooms":"households"]

      total_rooms  total_bedrooms  population  households
0            3885             661        1537         606
1            1510             310         809         277
2            3589             507        1484         495
3              67              15          49          11
4            1241             244         850         237
...           ...             ...         ...         ...
2995         1450             642        1258         607
2996         5257            1082        3496        1036
2997          956             201         693         220
2998           96              14          46          14
2999         1765             263         753         260

[3000 rows x 4 columns]

## Selección con enteros iloc

In [ ]:
cali_housing.iloc[:, 6:]

      households  median_income  median_house_value
0            606         6.6085              344700
1            277         3.5990              176500
2            495         5.7934              270500
3             11         6.1359              330000
4            237         2.9375               81700
...          ...            ...                 ...
2995         607         1.1790              225000
2996        1036         3.3906              237200
2997         220         2.2895               62000
2998          14         3.2708              162500
2999         260         8.5608              500001

[3000 rows x 3 columns]

## Asignación por rango

In [ ]:
#primero agregamos una columna random inicializada a 0
cali_housing["random"] = 0.0
#reasignamos usando np.random
cali_housing.loc[:, "random"] = np.random.randn(cali_housing.shape[0])
cali_housing

      longitude  latitude  ...  median_house_value    random
0       -122.05     37.37  ...              344700 -0.160436
1       -118.30     34.26  ...              176500  0.678597
2       -117.81     33.78  ...              270500  0.152683
3       -118.36     33.82  ...              330000 -0.013950
4       -119.67     36.33  ...               81700 -0.988726
...         ...       ...  ...                 ...       ...
2995    -119.86     34.42  ...              225000  1.212056
2996    -118.14     34.06  ...              237200  1.731682
2997    -119.70     36.30  ...               62000  0.959838
2998    -117.12     34.10  ...              162500  0.890985
2999    -119.63     34.42  ...              500001 -0.370769

[3000 rows x 10 columns]

## Selección con indexación booleana

In [ ]:
cali_housing[cali_housing["total_bedrooms"] > 1000]

      longitude  latitude  ...  median_house_value    random
19      -122.59     38.01  ...              414300  2.037763
24      -117.28     33.28  ...              150700  1.106254
26      -122.42     37.76  ...              250000 -0.334876
28      -118.45     34.07  ...              350000 -0.713185
33      -118.08     34.55  ...              141800  0.832530
...         ...       ...  ...                 ...       ...
2969    -118.11     34.68  ...              140100 -0.325795
2971    -120.93     35.76  ...              154300 -0.694757
2973    -122.73     38.46  ...              135400  0.301618
2979    -117.91     34.09  ...              185400 -0.705716
2996    -118.14     34.06  ...              237200  1.731682

[279 rows x 10 columns]

## Selección de celdas con at y iat

**at** utiliza etiquetas para seleccionar elementos:

In [ ]:
cali_housing.at[0, "housing_median_age"]

27

**iat** utiliza enteros para seleccionar elementos:

In [ ]:
cali_housing.iat[1, 4]

310

## Asignación elemento

También puedes cambir el contenido de las celdas directamente mediante asignación:

In [ ]:
cali_housing.iat[1, 4] = 200.0
cali_housing

      longitude  latitude  ...  median_house_value    random
0       -122.05     37.37  ...              344700 -0.160436
1       -118.30     34.26  ...              176500  0.678597
2       -117.81     33.78  ...              270500  0.152683
3       -118.36     33.82  ...              330000 -0.013950
4       -119.67     36.33  ...               81700 -0.988726
...         ...       ...  ...                 ...       ...
2995    -119.86     34.42  ...              225000  1.212056
2996    -118.14     34.06  ...              237200  1.731682
2997    -119.70     36.30  ...               62000  0.959838
2998    -117.12     34.10  ...              162500  0.890985
2999    -119.63     34.42  ...              500001 -0.370769

[3000 rows x 10 columns]

# Atributos

* df.T
* df.axes
* df.dtypes
* df.shape
* df.size
* df.values

## df.T

La transpuesta de df (filas y columnas intercambiadas):

In [ ]:
#Los indices pasan a ser los nombres de las columnas, las columnas a indices
cali_housing.T

                             0              1     ...           2998           2999
longitude             -122.050000    -118.300000  ...    -117.120000    -119.630000
latitude                37.370000      34.260000  ...      34.100000      34.420000
housing_median_age      27.000000      43.000000  ...      40.000000      42.000000
total_rooms           3885.000000    1510.000000  ...      96.000000    1765.000000
total_bedrooms         661.000000     200.000000  ...      14.000000     263.000000
population            1537.000000     809.000000  ...      46.000000     753.000000
households             606.000000     277.000000  ...      14.000000     260.000000
median_income            6.608500       3.599000  ...       3.270800       8.560800
median_house_value  344700.000000  176500.000000  ...  162500.000000  500001.000000
random                  -0.160436       0.678597  ...       0.890985      -0.370769

[10 rows x 3000 columns]

## df.axes

Retorna información sobre los axes que componen al objeto:

In [ ]:
cali_housing.axes

[Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
             ...
             2990, 2991, 2992, 2993, 2994, 2995, 2996, 2997, 2998, 2999],
            dtype='int64', length=3000),
 Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
        'total_bedrooms', 'population', 'households', 'median_income',
        'median_house_value', 'random'],
       dtype='object')]

## df.dtypes

Retorna los tipos de datos utilizados por el objeto:

In [ ]:
cali_housing.dtypes

longitude             float64
latitude              float64
housing_median_age      int64
total_rooms             int64
total_bedrooms          int64
population              int64
households              int64
median_income         float64
median_house_value      int64
random                float64
dtype: object

## df.shape

La forma del objeto (número de filas y columnas en un DataFrame):

In [ ]:
cali_housing.shape

(3000, 10)

## df.size

El número de elementos en el objeto (número de celdas en un DataFrame):

In [ ]:
cali_housing.size

30000

## df.values

Retorna el objeto de Pandas como un arreglo de Numpy:

In [ ]:
df.values

array([[-1.95987443, -0.7130089 ,  0.80605889, -0.66298884],
       [-0.40915446, -0.64048059, -1.4139337 , -0.28423197],
       [ 0.21255984,  0.2558213 ,  0.62693588,  1.1698601 ],
       [ 1.44562043,  0.80940111,  0.81612901,  0.6714292 ],
       [-0.37913344, -0.26129881,  0.03435447,  1.32562083],
       [ 0.96315875, -1.30140919, -1.23605117,  0.46455795]])

# Eliminación

## Remover filas o columnas con df.drop()

El método drop() permite eliminar filas o columnas al especificar el axis correspondiente, puedes eliminar más de una usando una lista como parámetro:

In [ ]:
#primero agregamos dos nuevas columnas
cali_housing["temp"] = "temp"
cali_housing["temp2"] = cali_housing["temp"] + "2"
cali_housing

      longitude  latitude  housing_median_age  ...    random  temp  temp2
0       -122.05     37.37                  27  ... -0.160436  temp  temp2
1       -118.30     34.26                  43  ...  0.678597  temp  temp2
2       -117.81     33.78                  27  ...  0.152683  temp  temp2
3       -118.36     33.82                  28  ... -0.013950  temp  temp2
4       -119.67     36.33                  19  ... -0.988726  temp  temp2
...         ...       ...                 ...  ...       ...   ...    ...
2995    -119.86     34.42                  23  ...  1.212056  temp  temp2
2996    -118.14     34.06                  27  ...  1.731682  temp  temp2
2997    -119.70     36.30                  10  ...  0.959838  temp  temp2
2998    -117.12     34.10                  40  ...  0.890985  temp  temp2
2999    -119.63     34.42                  42  ... -0.370769  temp  temp2

[3000 rows x 12 columns]

Eliminar columnas con axis = 1

In [ ]:
#drop devuelve un nuevo dataframe sin la columna
df = cali_housing.drop(["temp", "temp2"], axis=1)
df

      longitude  latitude  ...  median_house_value    random
0       -122.05     37.37  ...              344700 -0.160436
1       -118.30     34.26  ...              176500  0.678597
2       -117.81     33.78  ...              270500  0.152683
3       -118.36     33.82  ...              330000 -0.013950
4       -119.67     36.33  ...               81700 -0.988726
...         ...       ...  ...                 ...       ...
2995    -119.86     34.42  ...              225000  1.212056
2996    -118.14     34.06  ...              237200  1.731682
2997    -119.70     36.30  ...               62000  0.959838
2998    -117.12     34.10  ...              162500  0.890985
2999    -119.63     34.42  ...              500001 -0.370769

[3000 rows x 10 columns]

Eliminar filas con axis = 0

In [ ]:
#drop devuelve un nuevo dataframe sin la fila
df = cali_housing.drop([5,7,9], axis=0)
df

NameError: ignored

# Remover columnas con del

Puedes usar la notación _del df[col_name]_ para eliminar una columna directamente de un DataFrame:

In [ ]:
#el dataframe original no ha sido alterado
#aun contiene las columnas temporales
cali_housing

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085              344700
1       -118.30     34.26  ...         3.5990              176500
2       -117.81     33.78  ...         5.7934              270500
3       -118.36     33.82  ...         6.1359              330000
4       -119.67     36.33  ...         2.9375               81700
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790              225000
2996    -118.14     34.06  ...         3.3906              237200
2997    -119.70     36.30  ...         2.2895               62000
2998    -117.12     34.10  ...         3.2708              162500
2999    -119.63     34.42  ...         8.5608              500001

[3000 rows x 9 columns]

In [ ]:
#eliminamos la nueva columna temp con del directamente en el df
del cali_housing["temp"]
cali_housing

KeyError: ignored

In [ ]:
#del elimina una columna a la vez
# llamemos del una segunda vez para eliminar temp2
del cali_housing["temp2"]
cali_housing

KeyError: ignored

# Datos faltantes

En Pandas, los valores faltantes son representado con el valor NaN (de Not a Number). Cuando existen valores faltantes, muchas veces es necesario eliminarlar las entradas que los contienen o reemplazarlos por valores antes de empezar a trabajar con los datos. Pandas provee algunos métodos para realizar este tipo de tareas.

In [ ]:
#creando un dataframe con datos faltantes
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['A', 'B', 'C'])
df['D'] = df['A'] > 0
df = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

          A         B         C      D
a  0.021820 -0.731079 -0.953484   True
b       NaN       NaN       NaN    NaN
c  0.187802 -0.810518 -0.449295   True
d       NaN       NaN       NaN    NaN
e  1.708082  0.284112  0.687721   True
f -1.371643  0.118616  0.149498  False
g       NaN       NaN       NaN    NaN
h -0.324343  0.040993 -0.074619  False

## df.isna()

El método isna() funciona para conocer si el objeto contiene valores faltantes. Regresa un objeto con elementos booleanos que indican la existencia de datos faltantes.

In [ ]:
df.isna()

       A      B      C      D
a  False  False  False  False
b   True   True   True   True
c  False  False  False  False
d   True   True   True   True
e  False  False  False  False
f  False  False  False  False
g   True   True   True   True
h  False  False  False  False

## df.dropna()

El método dropna() permite eliminar del DataFrame las filas o columnas que contienen uno o más elementos NaN.

Los principales parámetros de dropna():

```
axis : {0 o 'index', 1 o 'columns'}, por defecto 0
        Determina si elimina filas o columnas que contienen
        valores faltantes.
    
how : {'any', 'all'}, por defecto 'any'
    Determina si se elimina la fila o columna cuando contiene al menos un valor faltante o solo si todos sus valores son faltantes.

    * 'any' : Si hay un valor faltante, elimina la fila o columna.
    * 'all' : Si todos los valores son faltantes, elimina la fila o columna.
    
thresh : int, opcional
    Requirir al menos ese número de valores faltantes para eliminar la fila o columna.
```

In [ ]:
df.dropna(axis=0, how='any')

          A         B         C      D
a  0.021820 -0.731079 -0.953484   True
c  0.187802 -0.810518 -0.449295   True
e  1.708082  0.284112  0.687721   True
f -1.371643  0.118616  0.149498  False
h -0.324343  0.040993 -0.074619  False

In [ ]:
#insertando un nuevo nan
df.iat[0, 0] = np.nan

In [ ]:
df.dropna(axis = 0, how='all')

          A         B         C      D
a       NaN -0.731079 -0.953484   True
c  0.187802 -0.810518 -0.449295   True
e  1.708082  0.284112  0.687721   True
f -1.371643  0.118616  0.149498  False
h -0.324343  0.040993 -0.074619  False

## df.fillna()

El método fillna() permite reemplazar los valores faltantes en un DataFrame por otro valor.

Los principales parámetros de fillna():

```
value : escalar, diccionario, Series, o un DataFrame
    El valor utilizado para reemplazar los faltantes.
    Si es un diccionario, una serie o un dataframe, entonces
    se utiliza el valor asociado a la clave, indice o columna asociada.

method : {'backfill', 'bfill', 'pad', 'ffill', None}, por defecto None
    El método utilizado para rellenar los espacios vacios.
    * pad / ffill: usa el ultimo valor valido para rellenar 
    hacia adelante hasta el siguiente valor valido.
    * backfill / bfill: utilizar la siguiente observacion 
    valida para rellenar.

axis : {0 or 'index', 1 or 'columns'}
```

In [ ]:
#fillna con escalar
df.fillna(0.0)

In [ ]:
#usando un diccionario para reemplazar con un valor diferente cada columna
df.fillna({'five': False, 'one': 0.0, 'two': 0.0, 'three': 0.0})

In [ ]:
df.fillna(method='ffill')

In [ ]:
df.fillna(method='bfill')

# Métodos Utilitarios

* df.copy()
* df.sort_values()
* df.sort_index()

## df.copy()

Crea una copia profunda (por defecto) del objeto:

In [ ]:
df = cali_housing.copy()
df

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085              344700
1       -118.30     34.26  ...         3.5990              176500
2       -117.81     33.78  ...         5.7934              270500
3       -118.36     33.82  ...         6.1359              330000
4       -119.67     36.33  ...         2.9375               81700
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790              225000
2996    -118.14     34.06  ...         3.3906              237200
2997    -119.70     36.30  ...         2.2895               62000
2998    -117.12     34.10  ...         3.2708              162500
2999    -119.63     34.42  ...         8.5608              500001

[3000 rows x 9 columns]

## df.sort_values()

In [ ]:
df.sort_values("housing_median_age",ascending= False)

      longitude  latitude  ...  median_income  median_house_value
2507    -118.15     33.77  ...         4.1765              393900
1865    -122.28     37.90  ...        10.0825              397000
541     -117.18     32.76  ...         4.7396              441700
2876    -122.50     37.77  ...         5.0562              336700
306     -122.65     38.23  ...         3.1711              200800
...         ...       ...  ...            ...                 ...
2117    -117.51     34.16  ...         4.1000              315000
1271    -120.98     37.59  ...         4.6484              145900
2429    -117.20     33.58  ...         4.5936              174300
1115    -116.95     33.86  ...         1.6250               55000
842     -117.95     35.08  ...         4.8750              141700

[3000 rows x 9 columns]

## df.sort_index()

In [ ]:
#una muestra aleatoria
df = cali_housing.sample(5)
df

      longitude  latitude  ...  median_income  median_house_value
290     -122.40     37.59  ...         6.2306              500001
1483    -122.46     37.65  ...         5.2573              322900
1664    -117.08     32.74  ...         2.3812              135100
862     -117.68     35.65  ...         3.3269               81900
2678    -118.04     33.93  ...         4.1667              151900

[5 rows x 9 columns]

In [ ]:
#ordenar por index
df.sort_index()

# Métodos matemáticos

Operaciones binarias:

* add(other), suma elemento por elemento un DataFrames/Series y other.
* sub(other), resta elemento por elemento un DataFrames/Series y other.
* mul(other), multiplicación elemento por elemento de un DataFrames/Series por other.
* div(other), divide elemento por elemento un DataFrames/Series entre other.
* mod(other), calcula el módulo de un DataFrame/Series usando other.
* pow(other), calcula el exponente elemento por elemento de un DataFrame/Series elevado a la potencia de other.
* dot(other), producto punto o de matrices entre dos Series/DataFrames respectivamente.

_Las operaciones binarias pueden utilizar broadcasting._


Operaciones estadísticas:
* abs(), valor absoluto de los elementos.
* count(axis), cuenta el número de elementos no-nulos en las filas o columnas. 
* max(axis), retorna el valor máximo encontrado por filas o columnas.
* min(axis), retorna el valor mínimo encontrado por filas o columnas.
* mean(axis), retorna la media de los elementos por filas o columnas.
* median(axis), retorna la mediana de los elementos de las filas o columnas.
* sum(axis), retorna la suma de todos los elementos de las filas o columnas.
* std(axis), retorna la desviación estándar de las filas o columnas.
* var(axis),retorna la varianza de las filas o columnas.

## Operaciones binarias

In [ ]:
#creamos un dataframe para ejemplificar las funciones
df = pd.DataFrame({'angles': [0, 3, 4], 'degrees': [360, 180, 360]}, index=['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

### add(), sub(), mul() y div()

In [ ]:
df.add(1)

           angles  degrees
circle          1      361
triangle        4      181
rectangle       5      361

In [ ]:
df.mul(3)

           angles  degrees
circle          0     1080
triangle        9      540
rectangle      12     1080

In [ ]:
df.div(2)

           angles  degrees
circle        0.0    180.0
triangle      1.5     90.0
rectangle     2.0    180.0

### mod() y pow()

In [ ]:
df.mod(2)

In [ ]:
df.pow(3)

           angles   degrees
circle          0  46656000
triangle       27   5832000
rectangle      64  46656000

### dot()

In [ ]:
#un nuevo dataframe para ejemplificar dot
df = pd.DataFrame([[0, 1, -2, -1], [1, 1, 1, 1]])
df

   0  1  2  3
0  0  1 -2 -1
1  1  1  1  1

In [ ]:
#dot usando una serie
s = pd.Series([1, 1, 2, 1])
df.dot(s)

0   -4
1    5
dtype: int64

In [ ]:
#dot de dos matrices
other = pd.DataFrame([[0, 1], [1, 2], [-1, -1], [2, 0]])
df.dot(other)

   0  1
0  1  4
1  2  2

## Operaciones estadísticas

### abs()

In [ ]:
#un df con valores negativos
df = pd.DataFrame({'a': [4, -5, -6, 7], 'b': [-10, 20, 30, -40], 'c': [100, 50, -30, -50]})
df

   a   b    c
0  4 -10  100
1 -5  20   50
2 -6  30  -30
3  7 -40  -50

In [ ]:
df.abs()

   a   b    c
0  4  10  100
1  5  20   50
2  6  30   30
3  7  40   50

### count()

In [ ]:
#un dataframe con valores no-nulos y nuelos
df = pd.DataFrame({"Person":["John", "Myla", "Lewis", "John", "Myla"],
                    "Age": [24., np.nan, 21., 33, 26],
                    "Single": [False, True, True, np.nan, np.nan]})
df

  Person   Age Single
0   John  24.0  False
1   Myla   NaN   True
2  Lewis  21.0   True
3   John  33.0    NaN
4   Myla  26.0    NaN

Por columna (por defecto axis=0):

In [ ]:
df.count()

Person    5
Age       4
Single    3
dtype: int64

Por fila (axis=1)

In [ ]:
df.count(axis=1)

0    3
1    2
2    3
3    2
4    2
dtype: int64

### max() y min()

In [ ]:
#creamos un dataframe para ejemplificar las funciones
df = pd.DataFrame({'angles': [0, 3, 4], 'degrees': [360, 180, 360]}, index=['circle', 'triangle', 'rectangle'])
df

           angles  degrees
circle          0      360
triangle        3      180
rectangle       4      360

Por columna (por defecto o axis=0):

In [ ]:
df.max(axis=0)

angles       4
degrees    360
dtype: int64

In [ ]:
df.min()

angles       0
degrees    180
dtype: int64

Por filas:

In [ ]:
df.max(axis=1)

circle       360
triangle     180
rectangle    360
dtype: int64

In [ ]:
df.min(axis=1)

circle       0
triangle     3
rectangle    4
dtype: int64

### mean() y median()

Por columnas (por defecto axis=0)

In [ ]:
df.mean()

angles       2.333333
degrees    300.000000
dtype: float64

In [ ]:
df.median()

angles       3.0
degrees    360.0
dtype: float64

Por filas (axis=1):

In [ ]:
df.mean(axis=1)

circle       180.0
triangle      91.5
rectangle    182.0
dtype: float64

In [ ]:
df.median(axis=1)

circle       180.0
triangle      91.5
rectangle    182.0
dtype: float64

### sum()

Por columnas (por defecto axis=0):

In [ ]:
df.sum()

angles       7
degrees    900
dtype: int64

Por filas (axis=1):

In [ ]:
df.sum(axis=1)

circle       360
triangle     183
rectangle    364
dtype: int64

### std() y var()

Por columnas (por defecto axis=0):

In [ ]:
df.std()

angles       2.081666
degrees    103.923048
dtype: float64

In [ ]:
df.var()

angles         4.333333
degrees    10800.000000
dtype: float64

Por filas (axis=1):

In [ ]:
df.std(axis=1)

circle       254.558441
triangle     125.157900
rectangle    251.730014
dtype: float64

In [ ]:
df.var(axis=1)

circle       64800.0
triangle     15664.5
rectangle    63368.0
dtype: float64

# Aplicando funciones propias

## apply()

Recibe una función y la aplica a todas las filas o columnas según el axis indicado.

In [ ]:
f = lambda x: (x - x.mean())/x.var()

#aplica la funcion a todas las filas
cali_housing.apply(f, axis=0)

      longitude  latitude  ...  median_income  median_house_value
0     -0.618327  0.382452  ...       0.814497            0.000011
1      0.323938 -0.303250  ...      -0.060558           -0.000002
2      0.447061 -0.409082  ...       0.577495            0.000005
3      0.308862 -0.400263  ...       0.677082            0.000010
4     -0.020303  0.153150  ...      -0.252898           -0.000010
...         ...       ...  ...            ...                 ...
2995  -0.068044 -0.267973  ...      -0.764207            0.000001
2996   0.364142 -0.347347  ...      -0.121153            0.000002
2997  -0.027841  0.146535  ...      -0.441314           -0.000011
2998   0.620438 -0.338528  ...      -0.155987           -0.000003
2999  -0.010252 -0.267973  ...       1.382155            0.000023

[3000 rows x 9 columns]

In [ ]:
#aplica la funcion a todas las columnas
cali_housing.apply(f, axis=1)

      longitude  latitude  ...  median_income  median_house_value
0     -0.000003 -0.000003  ...      -0.000003            0.000023
1     -0.000006 -0.000006  ...      -0.000006            0.000045
2     -0.000004 -0.000004  ...      -0.000004            0.000030
3     -0.000003 -0.000003  ...      -0.000003            0.000024
4     -0.000013 -0.000013  ...      -0.000013            0.000098
...         ...       ...  ...            ...                 ...
2995  -0.000005 -0.000005  ...      -0.000005            0.000036
2996  -0.000004 -0.000004  ...      -0.000004            0.000034
2997  -0.000017 -0.000017  ...      -0.000017            0.000130
2998  -0.000006 -0.000006  ...      -0.000006            0.000049
2999  -0.000002 -0.000002  ...      -0.000002            0.000016

[3000 rows x 9 columns]

## applymap()

Aplica una función elemento por elemento al objeto de Pandas.

In [ ]:
f = lambda x: round(x)

#aplica la funcion a todos los elementos
cali_housing.applymap(f)

      longitude  latitude  ...  median_income  median_house_value
0          -122        37  ...              7              344700
1          -118        34  ...              4              176500
2          -118        34  ...              6              270500
3          -118        34  ...              6              330000
4          -120        36  ...              3               81700
...         ...       ...  ...            ...                 ...
2995       -120        34  ...              1              225000
2996       -118        34  ...              3              237200
2997       -120        36  ...              2               62000
2998       -117        34  ...              3              162500
2999       -120        34  ...              9              500001

[3000 rows x 9 columns]

# Operaciones en columnas

Puedes realizar operaciones directamente en las columnas de un DataFrame para obtener resultados como una Serie o para crear nuevas columnas.  Por ejemplo:

* Relizar operaciones binarias entre columnas. (suma, resta, multiplicación, etc.).
* Aplicar métodos estadísticos en las columnas. (sum(), mean(), var(), etc.).
* Una mezcla de operaciones binarias y métodos.

In [ ]:
#creando un dataframe
df = pd.DataFrame({"A":[1, 2, 3], "B":[2, 2, 2]})
df

   A  B
0  1  2
1  2  2
2  3  2

In [ ]:
#operaciones entre columna regresan una serie
df["A"] * df["B"]

0    2
1    4
2    6
dtype: int64

In [ ]:
#generar una nueva columna desde una operacion
df["A^B"] = df["A"].pow(df["B"])
df

   A  B  A^B
0  1  2    1
1  2  2    4
2  3  2    9

In [ ]:
#aplicar un metodo estadistico a una columna genera un valor
df["A"].sum()

6

In [ ]:
#generando una nueva columna con la suma de las filas
df["suma"] = df.sum(axis=1)
df

   A  B  A^B  suma
0  1  2    1     4
1  2  2    4     8
2  3  2    9    14

# Funciones por grupos y agregación

## aggregate()/agg()

La agregación de datos es una transformación que produce un valor escalar a partir de un arreglo, por ejemplo, las funciones/métodos "sum" y "mean". Los métodos aggregate() y su alias agg() permiten aplicar una o más funciones de agregación a los objetos de Pandas. 

Los parámetros principales son:



```
func : funcion, str, list o dict
  La funcion o funciones utilizada spara la agregacion de los datos.

  Las combinaciones aceptadas:

  funcion
  cadena con el nombre de la funcion
  lista de funciones y/o nombre de las funciones (ej, [np.sum, 'mean'])
  diccionario de etiquetas del axis que mapean a:
  - las funciones.
  - nombre de funciones.
  - lista de funciones.

axis : {0 or ‘index’, 1 or ‘columns’}, por defecto 0
  Si axis=0 o ‘index’: aplica la funcion a cada columna.
  Si axis=1 o ‘columns’: aplica la funcion a cada fila.
```

In [ ]:
df = pd.DataFrame([[1, 2, 3],
                   [4, 5, 6],
                   [7, 8, 9]],
                  columns=['A', 'B', 'C'])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

Por columna (por defecto axis=0):

In [ ]:
#funcion de agregacion para calcular varios estadisticos a las columnas
df.agg(["max", "min","mean"],axis=0)

        A    B    C
max   7.0  8.0  9.0
min   1.0  2.0  3.0
mean  4.0  5.0  6.0

Por filas (axis=1):

In [ ]:
#funcion de agregacion para calcular varios estadisticos a las filas
df.agg(["min", "max"], axis=1)

   min  max
0    1    3
1    4    6
2    7    9

Usando un diccionario como parámetro:

In [ ]:
df.agg({"A": np.min, "B": np.max, "C": np.mean})

A    1.0
B    8.0
C    6.0
dtype: float64

## groupby()

El método groupby() permite generar grupos de datos usando una o más columnas para aplicar funciones de transformación o de agregación. 

Groupby es útil para contestar preguntas tipo: ¿cuál es la media de altura en hombres y mujeres? o ¿cúal es estado con menor población para cada país?

In [ ]:
df = pd.DataFrame({"Sexo": ["M", "F", "F", "M"], "Altura": [1.68, 1.55, 1.75, 1.82], "Peso": [70, 50, 68, 72]})
df

  Sexo  Altura  Peso
0    M    1.68    70
1    F    1.55    50
2    F    1.75    68
3    M    1.82    72

In [ ]:
#generar un dataframe argupado por una columna
df.groupby("Sexo")
df

  Sexo  Altura  Peso
0    M    1.68    70
1    F    1.55    50
2    F    1.75    68
3    M    1.82    72

groupby() por si solo no resulta en la salida esperada.

Hay que aplicar una función:

In [ ]:
#la media de las columnas
df.groupby("Sexo").mean()

      Altura  Peso
Sexo
F       1.65    59
M       1.75    71

In [ ]:
#seleccionando una sola columna para la agregacion
df.groupby("Sexo")["Altura"].mean()

**groupby() y agg()**

Puedes mezclar groupby() con agg() para aplicar más de una función.

In [ ]:
df.groupby("Sexo").agg(["mean", "std"])

     Altura           Peso
       mean       std mean        std
Sexo
F      1.65  0.141421   59  12.727922
M      1.75  0.098995   71   1.414214

**Agrupando con más de una columna**

In [ ]:
#agregar una nueva columna al df
df["Estado"] = ["Morelos", "DF", "DF", "DF"]
df

  Sexo  Altura  Peso   Estado
0    M    1.68    70  Morelos
1    F    1.55    50       DF
2    F    1.75    68       DF
3    M    1.82    72       DF

In [ ]:
#usando mas de una clave para la agrupacion
df.groupby(["Sexo", "Estado"]).agg(["mean", np.linalg.norm])

          A         B
       mean norm mean norm
Estado    3    3    4    4
Sexo      1    1    2    2

# Combinar Dataframes

## append()

Concatena las filas de un DataFrame a otro usando las columnas que coinciden. Columnas que no coinciden son agregadas al DataFrame resultante.

In [ ]:
df = pd.DataFrame([[1, 2], [3, 4]], columns=["A", "B"])
df

   A  B
0  1  2
1  3  4

In [ ]:
df2 = df2 = pd.DataFrame([[5, 6, 7], [8,9,10]], columns=["A", "B","C"])
df2

   A  B   C
0  5  6   7
1  8  9  10

In [ ]:
df.append(df2)

/usr/local/lib/python3.6/dist-packages/pandas/core/frame.py:7138: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

   A  B     C
0  1  2   NaN
1  3  4   NaN
0  5  6   7.0
1  8  9  10.0

## merge() y join()

Joins al estilo SQL.

Si no conoces SQL visita este sitio para darte una idea de los tipos de joins disponibles: https://www.w3schools.com/sql/sql_join.asp

![dofactory.com](https://www.dofactory.com/Images/sql-joins.png)

**merge()**

Parámetros principales:


```
right : DataFrame o  Series
  Objeto con el que realizar merge()

how:{‘left’, ‘right’, ‘outer’, ‘inner’}, Por defecto ‘inner’
  Type of merge to be performed.

  left: similar a un left outer join de SQL.
  right: similar a un  right outer join SQL.
  outer:  similar a un full outer join SQL.
  inner: similar a un inner join de SQL.

on : etiqueta o lista de etiquetas
  Columnas o indices para unir. Deben estar en ambos DataFrames.

left_on : etiqueta, lista de etiquetas
  Columnas o indices para unir del DataFrame de la izquierda.

right_on : etiqueta, lista de etiquetas
  Columnas o indices para unir del DataFrame de la derecha.
```

In [ ]:
df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]})
df1

   key  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [ ]:
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]})
df2

   key  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [ ]:
df1.merge(df2, how="inner", on="key")

   key  value_x  value_y
0  foo        1        5
1  foo        1        8
2  foo        5        5
3  foo        5        8
4  bar        2        6
5  baz        3        7

**join()**

Permite unir las columnas de uno o más objetos usando su índice o usando una columna como clave.


Parámetros:
```
other : DataFrame, Series, o lista de DataFrames

on : str o lista de str, opcional (por defecto usa los indices)

how:{‘left’, ‘right’, ‘outer’, ‘inner’}, Por defecto ‘inner’
  Type of merge to be performed.

  left: usar el indice del DataFrame que llama al metodo.
  right: usar el indice de other.
  outer:  union de los indices.
  inner: interseccion de los indices.

lsuffix : str, por defecto ‘’
  sufijo a utilizar del dataframe izq para la columnas sobrelapadas.

rsuffix : str, default ‘’
  sufijo a utilizar del dataframe der para la columnas sobrelapadas.
```

In [ ]:
df1 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [1, 2, 3, 5]}).set_index("key")
df1

     value
key
foo      1
bar      2
baz      3
foo      5

In [ ]:
df2 = pd.DataFrame({'key': ['foo', 'bar', 'baz', 'foo'], 'value': [5, 6, 7, 8]}).set_index("key")
df2

     value
key
foo      5
bar      6
baz      7
foo      8

In [ ]:
df1.join(df2, lsuffix="_l", rsuffix="_r")

     value_l  value_r
key
bar        2        6
baz        3        7
foo        1        5
foo        1        8
foo        5        5
foo        5        8

# Cadenas

Muchas de los métodos/funciones de Python para variables string, tienen un método equivalente en los objetos Series y DataFrames de Pandas.

Métodos principales para cadenas:

* str.cat(other, sep), concatenta sep y other a cada str en el objeto.
* str.split(str), divide la cadena usando el separador especificado.
* str.replace(patt, repl), reemplaza en la cadena patt por repl.
* str.lower() y str.upper(), para convertir cadenas a minúsculas o mayúsculas.
* str.len(), calcula la longitud de la cadena.
* str.count(str), cuenta el número de apariciones de str en la cadena.
* str.strip(str), elimina str al inicio y final de la cadena.

Visita la documentación para la lista completa de [métodos para cadenas de texto de Pandas](https://pandas.pydata.org/pandas-docs/stable/user_guide/text.html#method-summary).

In [ ]:
s1 = pd.Series(["A", "B", "C"])
s1

0    A
1    B
2    C
dtype: object

In [ ]:
s2 = pd.Series(["1", "2", "3"])
s2

0    1
1    2
2    3
dtype: object

In [ ]:
#concatenando s1 y s2 generando s3
s3 = s1.str.cat(s2, sep="-")
s3

0    A-1
1    B-2
2    C-3
dtype: object

In [ ]:
#str split
s3.str.split("-")

0    [A, 1]
1    [B, 2]
2    [C, 3]
dtype: object

In [ ]:
#str.replace
s3.str.replace(pat="-", repl="_")

0    A_1
1    B_2
2    C_3
dtype: object

In [ ]:
#un nuevo df
s = pd.Series(["gato", "perro", "elefante"])

In [ ]:
#upper
s.str.upper()

0        GATO
1       PERRO
2    ELEFANTE
dtype: object

In [ ]:
#len
s.str.len()

0    4
1    5
2    8
dtype: int64

In [ ]:
#count
s.str.count("o")

0    1
1    1
2    0
dtype: int64

In [ ]:
#un nuevo df
s4 = pd.Series(["_A_", "_B_", "_C_", "_D_"])
s4

0    _A_
1    _B_
2    _C_
3    _D_
dtype: object

In [ ]:
s4.str.strip("_")

0    A
1    B
2    C
3    D
dtype: object

# Series de tiempo

Pandas utiliza el tipo de dato "Timestamp" para el manejo de fechas y tiempo.

## String a Timestamp

In [ ]:
ts_index = pd.to_datetime(["10/09/2006", "11/09/2006", "12/09/2006"])
ts_index

DatetimeIndex(['2006-10-09', '2006-11-09', '2006-12-09'], dtype='datetime64[ns]', freq=None)

Creando una serie de tiempo desde objetos:

In [ ]:
ts = pd.Series(["5", "10", "15"], index=ts_index)
ts

2006-10-09     5
2006-11-09    10
2006-12-09    15
dtype: object

Creando una serie de tiempo usando aleatoriamente usando Numpy y date_range de Pandas:

In [ ]:
ts = pd.Series(np.random.normal(0, 1, 100), index=pd.date_range(start="2006-01-01", periods=100, freq="D"))
ts.head(10)

2006-01-01   -0.149178
2006-01-02   -1.391077
2006-01-03    0.069124
2006-01-04   -1.349129
2006-01-05   -0.118142
2006-01-06    0.369815
2006-01-07    1.756218
2006-01-08   -0.274998
2006-01-09   -1.029905
2006-01-10    1.684656
Freq: D, dtype: float64

## Indexing

Puedes utilizar fechas para indexar una serie de tiempo:

In [ ]:
#usando el anio y mes como indice
ts["2006-02"]

2006-02-01   -0.193844
2006-02-02    2.390622
2006-02-03    0.641411
2006-02-04   -0.548074
2006-02-05    0.185789
2006-02-06   -0.741275
2006-02-07    0.645990
2006-02-08   -0.424972
2006-02-09    0.495229
2006-02-10   -0.242077
2006-02-11    1.279780
2006-02-12    1.289061
2006-02-13    0.169381
2006-02-14   -0.757396
2006-02-15   -0.471986
2006-02-16   -0.404526
2006-02-17   -2.044730
2006-02-18    0.503670
2006-02-19   -0.107773
2006-02-20   -2.412615
2006-02-21   -0.515289
2006-02-22    0.054879
2006-02-23   -1.550037
2006-02-24    0.661040
2006-02-25    1.114360
2006-02-26    0.343812
2006-02-27    0.459963
2006-02-28   -0.388547
Freq: D, dtype: float64

In [ ]:
#una rebanada entre fechas
ts["2006-02-20": "2006-03-10"]

2006-02-20   -2.412615
2006-02-21   -0.515289
2006-02-22    0.054879
2006-02-23   -1.550037
2006-02-24    0.661040
2006-02-25    1.114360
2006-02-26    0.343812
2006-02-27    0.459963
2006-02-28   -0.388547
2006-03-01   -0.725322
2006-03-02    1.822384
2006-03-03   -1.547441
2006-03-04   -0.234181
2006-03-05   -0.016259
2006-03-06    1.367736
2006-03-07    4.040254
2006-03-08    1.499947
2006-03-09   -0.954345
2006-03-10    1.708500
Freq: D, dtype: float64

## Resampling / agregación

Permite obtener desde una serie de tiempo una nueva serie de tiempo a una frecuencia de tiempo menor al agregar los datos.

In [ ]:
#De frecuencia por dias a semanas
ts.resample("W").mean()

2006-01-01   -0.149178
2006-01-08   -0.134027
2006-01-15    0.394807
2006-01-22   -0.179085
2006-01-29   -0.599690
2006-02-05    0.220403
2006-02-12    0.328819
2006-02-19   -0.444766
2006-02-26   -0.329121
2006-03-05   -0.089915
2006-03-12    0.981684
2006-03-19    0.639924
2006-03-26   -0.003630
2006-04-02    0.543973
2006-04-09    0.371085
2006-04-16    0.156955
Freq: W-SUN, dtype: float64

## Ventanas

Puedes aplicar ventanas deslizantes a series de tiempo para calcular distintos estadísticos.

In [ ]:
ts.rolling(window=2).mean().head(14)

2006-01-01         NaN
2006-01-02   -0.770127
2006-01-03   -0.660976
2006-01-04   -0.640003
2006-01-05   -0.733636
2006-01-06    0.125836
2006-01-07    1.063016
2006-01-08    0.740610
2006-01-09   -0.652452
2006-01-10    0.327375
2006-01-11    1.046530
2006-01-12    1.259927
2006-01-13    0.730453
2006-01-14    0.051378
Freq: D, dtype: float64